responseTemplates/DeLiQu.xml

<ns2:Envelope xmlns:ns2="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns4="urn:ucbru:gbo:v3" xmlns:ns3="urn:ucbru:gbo:v3:st" xmlns:ns6="urn:ucbru:gbo:v5:spdep" xmlns:ns20="http://mfms.ru/mfmsgate/push/devices" xmlns:ns5="urn:ucbru:gbo:v5:loan" xmlns:ns8="urn:ucbru:gbo:v5:card" xmlns:ns7="urn:ucbru:gbo:v5:acc" xmlns:ns13="urn:ucbru:gbo:v5:push:devices:response" xmlns:ns9="urn:ucbru:gbo:v5:cif" xmlns:ns12="urn:ucbru:gbo:v5:push:devices:request" xmlns:ns11="urn:ucbru:gbo:v5:ordst" xmlns:ns10="urn:ucbru:gbo:v5:docst" xmlns:ns17="urn:imb:gbo:BSCardStm" xmlns:ns16="urn:ucbru:gbo:v4" xmlns:ns15="urn:ucbru:gbo:v5" xmlns:ns14="urn:ucbru:gbo:v5:sdpmt" xmlns:ns19="urn:ucbru:esb:srv:sms" xmlns:ns18="urn:imb:gbo:BSCardAuthorization">
    <ns2:Header>
        <ns15:UCBRUHeaders>
            <ns15:Audit>
                <ns15:MessagePath>
                    <ns15:Step>
                        <ns15:Application.Module>SPDEPDeposListQuery.RequestHandler</ns15:Application.Module>
                        <ns15:VersionId>5</ns15:VersionId>
                        <ns15:TimeStamp>${generate.dateNow}</ns15:TimeStamp>
                        <ns15:RoutingRole>START</ns15:RoutingRole>
                        <ns15:Comment></ns15:Comment>
                    </ns15:Step>
                    <ns15:Step>
                        <ns15:Application.Module>SPDEPDeposListQuery.RequestHandler</ns15:Application.Module>
                        <ns15:VersionId>5</ns15:VersionId>
                        <ns15:TimeStamp>${generate.dateNow}</ns15:TimeStamp>
                        <ns15:RoutingRole>SUCCESS</ns15:RoutingRole>
                        <ns15:Comment></ns15:Comment>
                    </ns15:Step>
                </ns15:MessagePath>
            </ns15:Audit>
        </ns15:UCBRUHeaders>
    </ns2:Header>
    <ns2:Body>
        <ns6:SPDEPDepositList>
            <ns6:DepositList>
                <ns6:receive.id>${receive.id}</ns6:receive.id>
                <ns6:Deposit>
                    <ns6:DealRef>${receive.id}RURVTDC04O</ns6:DealRef>
                    <ns6:DealRefRus>${receive.id}RURVTDC04O</ns6:DealRefRus>
                    <ns6:Name>Classic deposit plus</ns6:Name>
                    <ns6:AccountNo>${AccountList.account1}</ns6:AccountNo>
                    <ns6:Principal>3088658.68</ns6:Principal>
                    <ns6:Ccy>RUR</ns6:Ccy>
                    <ns6:InterestRate>5.3</ns6:InterestRate>
                    <ns6:Dates>
                        <ns6:DealDate>2021-08-11</ns6:DealDate>
                        <ns6:MaturityDate>2022-05-11</ns6:MaturityDate>
                        <ns6:DepositTenorDay>271</ns6:DepositTenorDay>
                        <ns6:RealDepoTenorDay>273</ns6:RealDepoTenorDay>
                        <ns6:NextAccrualDate>2022-03-31</ns6:NextAccrualDate>
                    </ns6:Dates>
                    <ns6:Status>O</ns6:Status>
                    <ns6:Options>
                        <ns6:Withdrawal>N</ns6:Withdrawal>
                        <ns6:Replenishment>N</ns6:Replenishment>
                        <ns6:AutoRollover>N</ns6:AutoRollover>
                        <ns6:EarlyMaturityAllow>Y</ns6:EarlyMaturityAllow>
                        <ns6:CloseOnMaturity>Y</ns6:CloseOnMaturity>
                    </ns6:Options>
                </ns6:Deposit>
                <ns6:Deposit>
                    <ns6:DealRef>${receive.id}USDPRIM204</ns6:DealRef>
                    <ns6:DealRefRus>${receive.id}USDPRIM204</ns6:DealRefRus>
                    <ns6:Name>Deposit PRIME</ns6:Name>
                    <ns6:AccountNo>${AccountList.account12}</ns6:AccountNo>
                    <ns6:Principal>200000</ns6:Principal>
                    <ns6:Ccy>USD</ns6:Ccy>
                    <ns6:InterestRate>6</ns6:InterestRate>
                    <ns6:Dates>
                        <ns6:DealDate>2022-03-14</ns6:DealDate>
                        <ns6:MaturityDate>2022-04-14</ns6:MaturityDate>
                        <ns6:DepositTenorDay>31</ns6:DepositTenorDay>
                        <ns6:RealDepoTenorDay>31</ns6:RealDepoTenorDay>
                        <ns6:NextAccrualDate>2022-03-31</ns6:NextAccrualDate>
                    </ns6:Dates>
                    <ns6:Status>O</ns6:Status>
                    <ns6:Options>
                        <ns6:Withdrawal>N</ns6:Withdrawal>
                        <ns6:Replenishment>N</ns6:Replenishment>
                        <ns6:AutoRollover>N</ns6:AutoRollover>
                        <ns6:EarlyMaturityAllow>Y</ns6:EarlyMaturityAllow>
                        <ns6:CloseOnMaturity>Y</ns6:CloseOnMaturity>
                    </ns6:Options>
                </ns6:Deposit>
            </ns6:DepositList>
        </ns6:SPDEPDepositList>
    </ns2:Body>
</ns2:Envelope>